[
    {
        "title": "Projects",
        "items": [
            {
                "tag": "GameDev",
                "img": "https://img.itch.zone/aW1nLzE3NDY2NDE1LnBuZw==/315x250%23c/NfyFkF.png",
                "gif": "https://img.itch.zone/aW1hZ2UvMjkwMzkxMy8xNzY0MDIyMy5naWY=/347x500/fSDct1.gif",
                "title": "Ant Scaled",
                "info": {
                    "description": "RTS-like game where you command Ants, made for the GMTK Game Jam 2024",
                    "sections": [
                        {
                            "title": "Motivation:",
                            "content": "For the GMTK Game Jam 2024, with the theme of \"Built to Scale\" I decided to make a game where you can spawn and command units (Ants) that you can use to explore a map covered with a fog of war, to find other structures that you can interact with."
                        },
                        {
                            "title": "Roles:",
                            "content": "For this game I took the role of a solo-dev, so all the code and features were done by myself with the help of free Assets for the graphics."
                        },
                        {
                            "title": "Main Features:",
                            "list": [
                                {
                                    "item": "Spawning of units: Spawn unlimited units (Ants) with the click of a button on screen."
                                },
                                {
                                    "item": "Selection of units:",
                                    "list": [
                                        {
                                            "item": "Box Selection: Click and drag a box selection to select multiple units."
                                        },
                                        {
                                            "item": "Individual Selection: Click on a single unit to select it."
                                        },
                                        {
                                            "item": "Multiple Selection: Hold LeftCTRL + Click to select multiple units one at a time."
                                        }
                                    ]
                                },
                                {
                                    "item": "Selection of structures: Click on a structure to interact with it."
                                },
                                {
                                    "item": "Movement of units with Pathfinding: Right Clicking on the map moves the selected units to that location avoiding obstacles and finding the best route to get there."
                                },
                                {
                                    "item": "Camera Movement: Moving the cursor to the edges of the screen moves the camera in that direction."
                                },
                                {
                                    "item": "Fog of War: The map is covered by two layers of fog.",
                                    "list": [
                                        {
                                            "item": "Dark Fog: This fog is pitch black and gets erased when units travel through the map."
                                        },
                                        {
                                            "item": "Soft Fog: This fog lets you see the map but with a faded effect, it is located under the Dark Fog layer. Units and some structures have a defined radius where you can the see the clear map underneath."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "title": "Skills:",
                            "list": [
                                {
                                    "item": "Unity: For the game engine.",
                                    "list": [
                                        {
                                            "item": "Hex Tilemap System: For the map and fog of war (Dark Fog)."
                                        },
                                        {
                                            "item": "Input System: For the selection and command of units."
                                        },
                                        {
                                            "item": "NavMesh: For the pathfinding and movement of units."
                                        },
                                        {
                                            "item": "Canvas UI: For UI interaction with structures."
                                        },
                                        {
                                            "item": "Sprite Mask 2D: For the Soft Fog of the fog of war."
                                        },
                                        {
                                            "item": "WebGL Export: To generate a playable game in the browser."
                                        }
                                    ]
                                },
                                {
                                    "item": "Aseprite: To edit and create some pixel art graphics."
                                },
                                {
                                    "item": "Autodesk Sketchbook: To create the game's cover image."
                                }
                            ]
                        }
                    ]
                }
            },
            {
                "tag": "GameDev",
                "img": "https://img.itch.zone/aW1nLzEzMTI1NzcwLnBuZw==/315x250%23c/X0gvNg.png",
                "gif": "https://img.itch.zone/aW1hZ2UvMjIxNTY2MS8xNzY1MTM1NC5naWY=/250x600/Dda57I.gif",
                "title": "FreeZE",
                "info": {
                    "description": "2D top-down puzzle game, made for a week-long game jam",
                    "sections": [
                        {
                            "title": "Motivation:",
                            "content": "For the \"Do you wanna Jam?! 2023\" Game Jam, that ran for a week, with the theme of \"Freeze\" I decided to make a game where you play as \"Za\", a boy that has his sister \"Ze\" captured, and he has to go and Free her (Free Ze) by solving sokoban-like puzzles freezing melting rocks in order to push them over buttons"
                        },
                        {
                            "title": "Roles:",
                            "content": "For this game I took the role of",
                            "list": [
                                {
                                    "item": "Programmer: Coded all system and features."
                                },
                                {
                                    "item": "Artist: Made the character, environment and objects in pixel art."
                                },
                                {
                                    "item": "Composer: Made two tracks for the game's music."
                                }
                            ]
                        },
                        {
                            "title": "Main Features:",
                            "list": [
                                {
                                    "item": "Top Down Movement: The player moves in four directions (Vertical and Horizontal). The movement is grid-base with smooth animations for the transition between cells "
                                },
                                {
                                    "item": "Freeze and Push: The player can freeze rocks and push them around the level, these melt over time not being able to push them until they are freezed again."
                                },
                                {
                                    "item": "Swtich Activation: Unfreezed rocks activate the buttons on the level's floor upon contact. These are not activated by the freezed rocks or by the player."
                                },
                                {
                                    "item": "Reset Area: Pushing the reset button (or R key) resets the area where the player is in, affecting only the puzzle in that area."
                                },
                                {
                                    "item": "Mobile Support: The game can be played in a mobile's browser and it will detect it, showing on-screen buttons for touch interaction."
                                }
                            ]
                        },
                        {
                            "title": "Skills:",
                            "list": [
                                {
                                    "item": "Unity: For the game engine.",
                                    "list": [
                                        {
                                            "item": "Tilemap System: For the environment (ground/walls) and level design using Rule Tiles and Prefab Brushes."
                                        },
                                        {
                                            "item": "New Input System: For the player's movement for keyboard and mobile."
                                        },
                                        {
                                            "item": "Canvas UI: For the dialog boxes and UI."
                                        },
                                        {
                                            "item": "Animation/Animator: For the player and rocks animations"
                                        },
                                        {
                                            "item": "WebGL Export: To generate a playable game in the browser."
                                        }
                                    ]
                                },
                                {
                                    "item": "Aseprite: To create pixel art graphics for Tiles, Characters, Objects and Animations."
                                },
                                {
                                    "item": "LMMS: For the creation of the game's music."
                                }
                            ]
                        }
                    ]
                }
            },
            {
                "tag": "GameDev",
                "img": "https://img.itch.zone/aW1nLzEwOTE1MDEzLnBuZw==/315x250%23c/vN6l%2Bf.png",
                "gif": "https://img.itch.zone/aW1hZ2UvMTg1ODI2NC8xNzY1MTYzNS5naWY=/250x600/YNmlWp.gif",
                "title": "White Wonders",
                "info": {
                    "description": "VN Demo made for a VN focused game jam",
                    "sections": [
                        {
                            "title": "Motivation:",
                            "content": "For the \"Winter Visual Novel Jam 2022\" I wanted to make a system to create Visual Novel and make a small functional demo with it. So this is more like an experimental project rather than a game. The system focused on Nodes where each Node represent an entity on the Visual Novel, like a Text, a TextBox, an Image, an Event, etc."
                        },
                        {
                            "title": "Roles:",
                            "content": "For this game I took the role of",
                            "list": [
                                {
                                    "item": "Programmer: Coded the Node System"
                                },
                                {
                                    "item": "Artist: Made the images used for the Visual Novel"
                                }
                            ]
                        },
                        {
                            "title": "Main Features:",
                            "list": [
                                {
                                    "item": "For the VN itself:",
                                    "list": [
                                        {
                                            "item": "Text Display: The text appears character by character in the text boxes."
                                        },
                                        {
                                            "item": "Input Progression: Clicking on the screen or pressing Space makes the text finish the sentence or continuing to the next part if it is already finished."
                                        },
                                        {
                                            "item": "Text Boxes: There is 3 types of text boxes; Info Texts, Dialog Text, Narrator Text"
                                        },
                                        {
                                            "item": "Mobile Support: The game can be played in a mobile's browser."
                                        }
                                    ]
                                },
                                {
                                    "item": "For the Node System",
                                    "list": [
                                        {
                                            "item": "Text Node: This Node is used for every text in the game."
                                        },
                                        {
                                            "item": "Image Node: This Node is used to display images in the game."
                                        },
                                        {
                                            "item": "Bool Node: This Node is used to toggle on/off elements in the game."
                                        },
                                        {
                                            "item": "Composite Node: This Node is used to run two or more nodes at the same time."
                                        },
                                        {
                                            "item": "Event Node: This Node is used to trigger code functions in the game."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "title": "Skills:",
                            "list": [
                                {
                                    "item": "Unity: For the game engine.",
                                    "list": [
                                        {
                                            "item": "Scriptable Objects: Scriptable Objects were used for the Node System, each node was a Scriptable Object."
                                        },
                                        {
                                            "item": "Editor UI: Editor Scripting was used for making edits in the Scriptable Objects objects to make them a bit more user friendly when creating them."
                                        },
                                        {
                                            "item": "Canvas UI: For the elements of the game."
                                        },
                                        {
                                            "item": "WebGL Export: To generate a playable game in the browser."
                                        }
                                    ]
                                },
                                {
                                    "item": "Autodesk Sketchbook: To create the game's images."
                                }
                            ]
                        }
                    ]
                }
            },
            {
                "tag": "GameDev",
                "img": "https://img.itch.zone/aW1nLzQ0NTY4NDkucG5n/315x250%23c/jnlez%2F.png",
                "gif": "https://img.itch.zone/aW1hZ2UvNzk2MDc3LzE3NjUxOTEzLmdpZg==/250x600/GII4fY.gif",
                "title": "EventStory",
                "info": {
                    "description": "3D First Person Point & Click, Text Interactive game, made for a School project",
                    "sections": [
                        {
                            "title": "Motivation:",
                            "content": "For the GMTK Game Jam 2024, with the theme of \"Built to Scale\" I decided to make a game where you can spawn and command units (Ants) that you can use to explore a map covered with a fog of war, to find other structures that you can interact with."
                        },
                        {
                            "title": "Roles:",
                            "content": "For this game I took the role of a solo-dev, so all the code and features were done by myself with the help of free Assets for the graphics."
                        },
                        {
                            "title": "Main Features:",
                            "list": [
                                {
                                    "item": "Spawning of units: Spawns unlimeted units (Ants) with the click of a button on screen."
                                },
                                {
                                    "item": "Selection of units:",
                                    "list": [
                                        {
                                            "item": "Box Selection: Click and drag a box selection to select multiple units."
                                        },
                                        {
                                            "item": "Individual Selection: Click on a single unit to select it."
                                        },
                                        {
                                            "item": "Multiple Selection: Hold Left-CTRL + Click to select multiple units one at a time."
                                        }
                                    ]
                                },
                                {
                                    "item": "Selection of structures: Click on a structure to interact with it."
                                },
                                {
                                    "item": "Movement of units with Pathfinding: Right Clicking on the map moves the selected units to that location avoiding obstacles and finding the best route to get there."
                                },
                                {
                                    "item": "Fog of War: The map is covered by two layers of fog.",
                                    "list": [
                                        {
                                            "item": "Dark Fog: This fog is pitch black and gets erased when units travel through the map."
                                        },
                                        {
                                            "item": "Soft Fog: This fog lets you see the map but with a faded effect, it is located under the Dark Fog layer. Units and some structures have a defined radius where you can the see the clear map underneath."
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "title": "Skills:",
                            "list": [
                                {
                                    "item": "Unity: For the game engine.",
                                    "list": [
                                        {
                                            "item": "Hex Tilemap System: For the map and fog of war (Dark Fog)."
                                        },
                                        {
                                            "item": "Input System: For the selection and command of units."
                                        },
                                        {
                                            "item": "NavMesh: For the pathfinding and movement of units."
                                        },
                                        {
                                            "item": "Canvas UI: For UI interaction with structures."
                                        },
                                        {
                                            "item": "Sprite Mask 2D: For the Soft Fog of the fog of war."
                                        },
                                        {
                                            "item": "WebGL Export: To generate a playable game in the browser."
                                        }
                                    ]
                                },
                                {
                                    "item": "Aseprite: To edit and create some pixel art graphics."
                                },
                                {
                                    "item": "Autodesk Sketchbook: To create the game's cover image."
                                }
                            ]
                        }
                    ]
                }
            }
        ]
    }
]